In [12]:
import pandas as pd

In [239]:
my_dict={
    'day':['1/1/17','2/1/17','3/1/17','4/1/17','5/1/17','6/2/18'],
    'event':['Rain','Mist','Cloudy','sunny','Snow','cold'],
    'temperature':[32,45,66,77,55,33],
    'windspeed':[1,2,3,4,5,6],
    'city':['Mumbai','Banglore','hyderabad','kochin','vizag','chennai']
}
data=pd.DataFrame(my_dict)

In [108]:
data

      day   event  temperature  windspeed       city
0  1/1/17    Rain           32          1     Mumbai
1  2/1/17    Mist           45          2   Banglore
2  3/1/17  Cloudy           66          3  hyderabad
3  4/1/17   sunny           77          4     kochin
4  5/1/17    Snow           55          5      vizag
5  6/2/18    cold           33          6    chennai

In [100]:
data.columns

Index(['day', 'event', 'temperature', 'windspeed', 'city'], dtype='object')

In [101]:
data.shape

(6, 5)

In [109]:
data[data['temperature']==data['temperature'].max()]

      day  event  temperature  windspeed    city
3  4/1/17  sunny           77          4  kochin

In [111]:
data[data['temperature']==data['temperature'].min()]

      day event  temperature  windspeed    city
0  1/1/17  Rain           32          1  Mumbai

In [82]:
data['temperature'].mean()

51.333333333333336

In [83]:
data['temperature'].std()

18.09604008247845

In [89]:
data.describe ()

       temperature  windspeed
count     6.000000   6.000000
mean     51.333333   3.500000
std      18.096040   1.870829
min      32.000000   1.000000
25%      36.000000   2.250000
50%      50.000000   3.500000
75%      63.250000   4.750000
max      77.000000   6.000000

In [132]:
data[['day','city','windspeed']][data['temperature']==data['temperature'].max()]

      day    city  windspeed
3  4/1/17  kochin          4

In [128]:
data[data['temperature']==data['temperature'].max()]

      day  event  temperature  windspeed    city
3  4/1/17  sunny           77          4  kochin

In [133]:
data.index

RangeIndex(start=0, stop=6, step=1)

In [135]:
data.set_index('day',inplace=True)

In [138]:
data.loc['2/1/17']

event              Mist
temperature          45
windspeed             2
city           Banglore
Name: 2/1/17, dtype: object

In [142]:
data=data.reset_index()

In [150]:
data.set_index('event',inplace=True)

In [153]:
data

           day  temperature  windspeed       city
event
Rain    1/1/17           32          1     Mumbai
Mist    2/1/17           45          2   Banglore
Cloudy  3/1/17           66          3  hyderabad
sunny   4/1/17           77          4     kochin
Snow    5/1/17           55          5      vizag
cold    6/2/18           33          6    chennai

In [155]:
data.loc['Rain']

day            1/1/17
temperature        32
windspeed           1
city           Mumbai
Name: Rain, dtype: object

In [157]:
data.reset_index(inplace=True)

In [162]:
data.loc[0]

event            Rain
day            1/1/17
temperature        32
windspeed           1
city           Mumbai
Name: 0, dtype: object

In [165]:
data

    event     day  temperature  windspeed       city
0    Rain  1/1/17           32          1     Mumbai
1    Mist  2/1/17           45          2   Banglore
2  Cloudy  3/1/17           66          3  hyderabad
3   sunny  4/1/17           77          4     kochin
4    Snow  5/1/17           55          5      vizag
5    cold  6/2/18           33          6    chennai

In [170]:
#df.loc[df[‘column name’] condition]
data.loc[data['temperature']>50]

    event     day  temperature  windspeed       city
2  Cloudy  3/1/17           66          3  hyderabad
3   sunny  4/1/17           77          4     kochin
4    Snow  5/1/17           55          5      vizag

In [172]:
data[data['temperature']>50]

    event     day  temperature  windspeed       city
2  Cloudy  3/1/17           66          3  hyderabad
3   sunny  4/1/17           77          4     kochin
4    Snow  5/1/17           55          5      vizag

In [179]:
ex_data=pd.read_excel(r'C:\Users\saket\Desktop\xls\airline.xls','Sheet1')

In [188]:
ex_data

    YEAR       Y      W       R      L      K
0   1948   1.214  0.243  0.1454  1.415  0.612
1   1949   1.354  0.260  0.2181  1.384  0.559
2   1950   1.569  0.278  0.3157  1.388  0.573
3   1951   1.948  0.297  0.3940  1.550  0.564
4   1952   2.265  0.310  0.3559  1.802  0.574
5   1953   2.731  0.322  0.3593  1.926  0.711
6   1954   3.025  0.335  0.4025  1.964  0.776
7   1955   3.562  0.350  0.3961  2.116  0.827
8   1956   3.979  0.361  0.3822  2.435  0.800
9   1957   4.420  0.379  0.3045  2.707  0.921
10  1958   4.563  0.391  0.3284  2.706  1.067
11  1959   5.385  0.426  0.3856  2.846  1.083
12  1960   5.554  0.441  0.3193  3.089  1.481
13  1961   5.465  0.460  0.3079  3.122  1.736
14  1962   5.825  0.485  0.3783  3.184  1.926
15  1963   6.876  0.506  0.4180  3.263  2.041
16  1964   7.823  0.538  0.5163  3.412  1.997
17  1965   9.120  0.564  0.5879  3.623  2.257
18  1966  10.512  0.586  0.5369  4.074  2.742
19  1967  13.020  0.622  0.4443  4.710  3.564
20  1968  15.261  0.666  0.3052  5.217  4.767
21  1969  16.313  0.731  0.2332  5.569  6.511
22  1970  16.002  0.831  0.1883  5.495  7.627
23  1971  15.876  0.906  0.2023  5.334  8.673
24  1972  16.662  1.000  0.2506  5.345  8.331
25  1973  17.014  1.056  0.2668  5.662  8.557
26  1974  19.305  1.131  0.2664  5.729  9.508
27  1975  18.721  1.247  0.2301  5.722  9.062
28  1976  19.250  1.375  0.3452  5.762  8.262
29  1977  20.647  1.544  0.4508  5.877  7.474
30  1978  22.726  1.703  0.5877  6.108  7.104
31  1979  23.619  1.779  0.5346  6.852  6.874

In [237]:
#list of   tuples
lsit_of_tuple=[
    (1,'saket',6,'c','new panvel','male'),
    (2,'ashutosh',6,'c','kamothe','male'),
    (3,'mohini',6,'c','kahanda-colony','Female')
]
list_of_tuple_data=pd.DataFrame(lsit_of_tuple,columns=['rollno','name','std','div','add','gender'])

In [238]:
list_of_tuple_data

   rollno      name  std div             add  gender
0       1     saket    6   c      new panvel    male
1       2  ashutosh    6   c         kamothe    male
2       3    mohini    6   c  kahanda-colony  Female

In [234]:
#lsit of dictionry:
list_of_dict=[
    {'Roll_no':1,'Name':'saket','Std':6,'Div':'A','Add':'New_Panvel','Gender':'Male'},
    {'Roll_no':2,'Name':'ABC','Std':6,'Div':'A','Add':'New_Panvel','Gender':'Male'},
]
list_of_dict_data=pd.DataFrame(list_of_dict)

In [235]:
list_of_dict_data

   Roll_no   Name  Std Div         Add Gender
0        1  saket    6   A  New_Panvel   Male
1        2    ABC    6   A  New_Panvel   Male

In [240]:
data.to_csv(index=False)

'day,event,temperature,windspeed,city\r\n1/1/17,Rain,32,1,Mumbai\r\n2/1/17,Mist,45,2,Banglore\r\n3/1/17,Cloudy,66,3,hyderabad\r\n4/1/17,sunny,77,4,kochin\r\n5/1/17,Snow,55,5,vizag\r\n6/2/18,cold,33,6,chennai\r\n'